---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsEnableCalculationRuleChecking
source: html/8f502341-fce2-8fec-9461-6f2b18120792.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsEnableCalculationRuleChecking Property

"Enable Calculator Rules Check": Enable calculation rule checking

## Syntax (C#)
```csharp
public static ForgeTypeId StairsEnableCalculationRuleChecking { get; }
```